MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS506/mcu.h
#define _ADMOD1L_SIGN20_POSITION                 0x00000008
#define _ADMOD1L_SIGN20_MASK                     0x00000100
#define _ADMOD1L_SIGN20_LENGTH                   0x00000001

#define _ADMOD1L_DIFF20_POSITION                 0x00000009
#define _ADMOD1L_DIFF20_MASK                     0x00000200
#define _ADMOD1L_DIFF20_LENGTH                   0x00000001

#define _ADMOD1L_SIGN21_POSITION                 0x0000000A
#define _ADMOD1L_SIGN21_MASK                     0x00000400
#define _ADMOD1L_SIGN21_LENGTH                   0x00000001

#define _ADMOD1L_DIFF21_POSITION                 0x0000000B
#define _ADMOD1L_DIFF21_MASK                     0x00000800
#define _ADMOD1L_DIFF21_LENGTH                   0x00000001

#define _ADIEL_IE0_POSITION                      0x00000000
#define _ADIEL_IE0_MASK                          0x00000001
#define _ADIEL_IE0_LENGTH                        0x00000001

#define _ADIEL_IE1_POSITION                      0x00000001
#define _ADIEL_IE1_MASK                          0x00000002
#define _ADIEL_IE1_LENGTH                        0x00000001

#define _ADIEL_IE2_POSITION                      0x00000002
#define _ADIEL_IE2_MASK                          0x00000004
#define _ADIEL_IE2_LENGTH                        0x00000001

#define _ADIEL_IE3_POSITION                      0x00000003
#define _ADIEL_IE3_MASK                          0x00000008
#define _ADIEL_IE3_LENGTH                        0x00000001

#define _ADIEL_IE4_POSITION                      0x00000004
#define _ADIEL_IE4_MASK                          0x00000010
#define _ADIEL_IE4_LENGTH                        0x00000001

#define _ADIEL_IE5_POSITION                      0x00000005
#define _ADIEL_IE5_MASK                          0x00000020
#define _ADIEL_IE5_LENGTH                        0x00000001

#define _ADIEL_IE6_POSITION                      0x00000006
#define _ADIEL_IE6_MASK                          0x00000040
#define _ADIEL_IE6_LENGTH                        0x00000001

#define _ADIEL_IE7_POSITION                      0x00000007
#define _ADIEL_IE7_MASK                          0x00000080
#define _ADIEL_IE7_LENGTH                        0x00000001

#define _ADIEL_IE8_POSITION                      0x00000008
#define _ADIEL_IE8_MASK                          0x00000100
#define _ADIEL_IE8_LENGTH                        0x00000001

#define _ADIEL_IE9_POSITION                      0x00000009
#define _ADIEL_IE9_MASK                          0x00000200
#define _ADIEL_IE9_LENGTH                        0x00000001

#define _ADIEL_IE10_POSITION                     0x0000000A
#define _ADIEL_IE10_MASK                         0x00000400
#define _ADIEL_IE10_LENGTH                       0x00000001

#define _ADIEL_IE11_POSITION                     0x0000000B
#define _ADIEL_IE11_MASK                         0x00000800
#define _ADIEL_IE11_LENGTH                       0x00000001

#define _ADIEL_IE12_POSITION                     0x0000000C
#define _ADIEL_IE12_MASK                         0x00001000
#define _ADIEL_IE12_LENGTH                       0x00000001

#define _ADIEL_IE13_POSITION                     0x0000000D
#define _ADIEL_IE13_MASK                         0x00002000
#define _ADIEL_IE13_LENGTH                       0x00000001

#define _ADIEL_IE14_POSITION                     0x0000000E
#define _ADIEL_IE14_MASK                         0x00004000
#define _ADIEL_IE14_LENGTH                       0x00000001

#define _ADIEL_IE15_POSITION                     0x0000000F
#define _ADIEL_IE15_MASK                         0x00008000
#define _ADIEL_IE15_LENGTH                       0x00000001

#define _ADIEH_IE16_POSITION                     0x00000000
#define _ADIEH_IE16_MASK                         0x00000001
#define _ADIEH_IE16_LENGTH                       0x00000001

#define _ADIEH_IE17_POSITION                     0x00000001
#define _ADIEH_IE17_MASK                         0x00000002
#define _ADIEH_IE17_LENGTH                       0x00000001

#define _ADIEH_IE18_POSITION                     0x00000002
#define _ADIEH_IE18_MASK                         0x00000004
#define _ADIEH_IE18_LENGTH                       0x00000001

#define _ADIEH_IE19_POSITION                     0x00000003
#define _ADIEH_IE19_MASK                         0x00000008
#define _ADIEH_IE19_LENGTH                       0x00000001

#define _ADIEH_IE20_POSITION                     0x00000004
#define _ADIEH_IE20_MASK                         0x00000010
#define _ADIEH_IE20_LENGTH                       0x00000001

#define _ADIEH_IE21_POSITION                     0x00000005
#define _ADIEH_IE21_MASK                         0x00000020
#define _ADIEH_IE21_LENGTH                       0x00000001

#define _ADSTATL_AN0RDY_POSITION                 0x00000000
#define _ADSTATL_AN0RDY_MASK                     0x00000001
#define _ADSTATL_AN0RDY_LENGTH                   0x00000001

#define _ADSTATL_AN1RDY_POSITION                 0x00000001
#define _ADSTATL_AN1RDY_MASK                     0x00000002
#define _ADSTATL_AN1RDY_LENGTH                   0x00000001

#define _ADSTATL_AN2RDY_POSITION                 0x00000002
#define _ADSTATL_AN2RDY_MASK                     0x00000004
#define _ADSTATL_AN2RDY_LENGTH                   0x00000001

#define _ADSTATL_AN3RDY_POSITION                 0x00000003
#define _ADSTATL_AN3RDY_MASK                     0x00000008
#define _ADSTATL_AN3RDY_LENGTH                   0x00000001

#define _ADSTATL_AN4RDY_POSITION                 0x00000004
#define _ADSTATL_AN4RDY_MASK                     0x00000010
#define _ADSTATL_AN4RDY_LENGTH                   0x00000001

#define _ADSTATL_AN5RDY_POSITION                 0x00000005
#define _ADSTATL_AN5RDY_MASK                     0x00000020
#define _ADSTATL_AN5RDY_LENGTH                   0x00000001

#define _ADSTATL_AN6RDY_POSITION                 0x00000006
#define _ADSTATL_AN6RDY_MASK                     0x00000040
#define _ADSTATL_AN6RDY_LENGTH                   0x00000001

#define _ADSTATL_AN7RDY_POSITION                 0x00000007
#define _ADSTATL_AN7RDY_MASK                     0x00000080
#define _ADSTATL_AN7RDY_LENGTH                   0x00000001

#define _ADSTATL_AN8RDY_POSITION                 0x00000008
#define _ADSTATL_AN8RDY_MASK                     0x00000100
#define _ADSTATL_AN8RDY_LENGTH                   0x00000001

