MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS506/mcu.h
#define _ADCMP1CON_HILO_POSITION                 0x00000002
#define _ADCMP1CON_HILO_MASK                     0x00000004
#define _ADCMP1CON_HILO_LENGTH                   0x00000001

#define _ADCMP1CON_HIHI_POSITION                 0x00000003
#define _ADCMP1CON_HIHI_MASK                     0x00000008
#define _ADCMP1CON_HIHI_LENGTH                   0x00000001

#define _ADCMP1CON_BTWN_POSITION                 0x00000004
#define _ADCMP1CON_BTWN_MASK                     0x00000010
#define _ADCMP1CON_BTWN_LENGTH                   0x00000001

#define _ADCMP1CON_STAT_POSITION                 0x00000005
#define _ADCMP1CON_STAT_MASK                     0x00000020
#define _ADCMP1CON_STAT_LENGTH                   0x00000001

#define _ADCMP1CON_IE_POSITION                   0x00000006
#define _ADCMP1CON_IE_MASK                       0x00000040
#define _ADCMP1CON_IE_LENGTH                     0x00000001

#define _ADCMP1CON_CMPEN_POSITION                0x00000007
#define _ADCMP1CON_CMPEN_MASK                    0x00000080
#define _ADCMP1CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL_POSITION                 0x00000008
#define _ADCMP1CON_CHNL_MASK                     0x00001F00
#define _ADCMP1CON_CHNL_LENGTH                   0x00000005

#define _ADCMP1CON_CHNL0_POSITION                0x00000008
#define _ADCMP1CON_CHNL0_MASK                    0x00000100
#define _ADCMP1CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL1_POSITION                0x00000009
#define _ADCMP1CON_CHNL1_MASK                    0x00000200
#define _ADCMP1CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL2_POSITION                0x0000000A
#define _ADCMP1CON_CHNL2_MASK                    0x00000400
#define _ADCMP1CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL3_POSITION                0x0000000B
#define _ADCMP1CON_CHNL3_MASK                    0x00000800
#define _ADCMP1CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL4_POSITION                0x0000000C
#define _ADCMP1CON_CHNL4_MASK                    0x00001000
#define _ADCMP1CON_CHNL4_LENGTH                  0x00000001

#define _ADLVLTRGL_LVLEN0_POSITION               0x00000000
#define _ADLVLTRGL_LVLEN0_MASK                   0x00000001
#define _ADLVLTRGL_LVLEN0_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN1_POSITION               0x00000001
#define _ADLVLTRGL_LVLEN1_MASK                   0x00000002
#define _ADLVLTRGL_LVLEN1_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN2_POSITION               0x00000002
#define _ADLVLTRGL_LVLEN2_MASK                   0x00000004
#define _ADLVLTRGL_LVLEN2_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN3_POSITION               0x00000003
#define _ADLVLTRGL_LVLEN3_MASK                   0x00000008
#define _ADLVLTRGL_LVLEN3_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN4_POSITION               0x00000004
#define _ADLVLTRGL_LVLEN4_MASK                   0x00000010
#define _ADLVLTRGL_LVLEN4_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN5_POSITION               0x00000005
#define _ADLVLTRGL_LVLEN5_MASK                   0x00000020
#define _ADLVLTRGL_LVLEN5_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN6_POSITION               0x00000006
#define _ADLVLTRGL_LVLEN6_MASK                   0x00000040
#define _ADLVLTRGL_LVLEN6_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN7_POSITION               0x00000007
#define _ADLVLTRGL_LVLEN7_MASK                   0x00000080
#define _ADLVLTRGL_LVLEN7_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN8_POSITION               0x00000008
#define _ADLVLTRGL_LVLEN8_MASK                   0x00000100
#define _ADLVLTRGL_LVLEN8_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN9_POSITION               0x00000009
#define _ADLVLTRGL_LVLEN9_MASK                   0x00000200
#define _ADLVLTRGL_LVLEN9_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN10_POSITION              0x0000000A
#define _ADLVLTRGL_LVLEN10_MASK                  0x00000400
#define _ADLVLTRGL_LVLEN10_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN11_POSITION              0x0000000B
#define _ADLVLTRGL_LVLEN11_MASK                  0x00000800
#define _ADLVLTRGL_LVLEN11_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN12_POSITION              0x0000000C
#define _ADLVLTRGL_LVLEN12_MASK                  0x00001000
#define _ADLVLTRGL_LVLEN12_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN13_POSITION              0x0000000D
#define _ADLVLTRGL_LVLEN13_MASK                  0x00002000
#define _ADLVLTRGL_LVLEN13_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN14_POSITION              0x0000000E
#define _ADLVLTRGL_LVLEN14_MASK                  0x00004000
#define _ADLVLTRGL_LVLEN14_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN15_POSITION              0x0000000F
#define _ADLVLTRGL_LVLEN15_MASK                  0x00008000
#define _ADLVLTRGL_LVLEN15_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN16_POSITION              0x00000000
#define _ADLVLTRGH_LVLEN16_MASK                  0x00000001
#define _ADLVLTRGH_LVLEN16_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN17_POSITION              0x00000001
#define _ADLVLTRGH_LVLEN17_MASK                  0x00000002
#define _ADLVLTRGH_LVLEN17_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN18_POSITION              0x00000002
#define _ADLVLTRGH_LVLEN18_MASK                  0x00000004
#define _ADLVLTRGH_LVLEN18_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN19_POSITION              0x00000003
#define _ADLVLTRGH_LVLEN19_MASK                  0x00000008
#define _ADLVLTRGH_LVLEN19_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN20_POSITION              0x00000004
#define _ADLVLTRGH_LVLEN20_MASK                  0x00000010
#define _ADLVLTRGH_LVLEN20_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN21_POSITION              0x00000005
#define _ADLVLTRGH_LVLEN21_MASK                  0x00000020
#define _ADLVLTRGH_LVLEN21_LENGTH                0x00000001

#define _ADCORE0L_SAMC_POSITION                  0x00000000
#define _ADCORE0L_SAMC_MASK                      0x000003FF
#define _ADCORE0L_SAMC_LENGTH                    0x0000000A

#define _ADCORE0L_SAMC0_POSITION                 0x00000000
#define _ADCORE0L_SAMC0_MASK                     0x00000001
#define _ADCORE0L_SAMC0_LENGTH                   0x00000001

#define _ADCORE0L_SAMC1_POSITION                 0x00000001
#define _ADCORE0L_SAMC1_MASK                     0x00000002
#define _ADCORE0L_SAMC1_LENGTH                   0x00000001

#define _ADCORE0L_SAMC2_POSITION                 0x00000002
#define _ADCORE0L_SAMC2_MASK                     0x00000004
#define _ADCORE0L_SAMC2_LENGTH                   0x00000001

