MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS506/mcu.h
#define _RPOR16_RP176R0_POSITION                 0x00000000
#define _RPOR16_RP176R0_MASK                     0x00000001
#define _RPOR16_RP176R0_LENGTH                   0x00000001

#define _RPOR16_RP176R1_POSITION                 0x00000001
#define _RPOR16_RP176R1_MASK                     0x00000002
#define _RPOR16_RP176R1_LENGTH                   0x00000001

#define _RPOR16_RP176R2_POSITION                 0x00000002
#define _RPOR16_RP176R2_MASK                     0x00000004
#define _RPOR16_RP176R2_LENGTH                   0x00000001

#define _RPOR16_RP176R3_POSITION                 0x00000003
#define _RPOR16_RP176R3_MASK                     0x00000008
#define _RPOR16_RP176R3_LENGTH                   0x00000001

#define _RPOR16_RP176R4_POSITION                 0x00000004
#define _RPOR16_RP176R4_MASK                     0x00000010
#define _RPOR16_RP176R4_LENGTH                   0x00000001

#define _RPOR16_RP176R5_POSITION                 0x00000005
#define _RPOR16_RP176R5_MASK                     0x00000020
#define _RPOR16_RP176R5_LENGTH                   0x00000001

#define _RPOR16_RP177R0_POSITION                 0x00000008
#define _RPOR16_RP177R0_MASK                     0x00000100
#define _RPOR16_RP177R0_LENGTH                   0x00000001

#define _RPOR16_RP177R1_POSITION                 0x00000009
#define _RPOR16_RP177R1_MASK                     0x00000200
#define _RPOR16_RP177R1_LENGTH                   0x00000001

#define _RPOR16_RP177R2_POSITION                 0x0000000A
#define _RPOR16_RP177R2_MASK                     0x00000400
#define _RPOR16_RP177R2_LENGTH                   0x00000001

#define _RPOR16_RP177R3_POSITION                 0x0000000B
#define _RPOR16_RP177R3_MASK                     0x00000800
#define _RPOR16_RP177R3_LENGTH                   0x00000001

#define _RPOR16_RP177R4_POSITION                 0x0000000C
#define _RPOR16_RP177R4_MASK                     0x00001000
#define _RPOR16_RP177R4_LENGTH                   0x00000001

#define _RPOR16_RP177R5_POSITION                 0x0000000D
#define _RPOR16_RP177R5_MASK                     0x00002000
#define _RPOR16_RP177R5_LENGTH                   0x00000001

#define _RPOR17_RP178R_POSITION                  0x00000000
#define _RPOR17_RP178R_MASK                      0x0000003F
#define _RPOR17_RP178R_LENGTH                    0x00000006

#define _RPOR17_RP179R_POSITION                  0x00000008
#define _RPOR17_RP179R_MASK                      0x00003F00
#define _RPOR17_RP179R_LENGTH                    0x00000006

#define _RPOR17_RP178R0_POSITION                 0x00000000
#define _RPOR17_RP178R0_MASK                     0x00000001
#define _RPOR17_RP178R0_LENGTH                   0x00000001

#define _RPOR17_RP178R1_POSITION                 0x00000001
#define _RPOR17_RP178R1_MASK                     0x00000002
#define _RPOR17_RP178R1_LENGTH                   0x00000001

#define _RPOR17_RP178R2_POSITION                 0x00000002
#define _RPOR17_RP178R2_MASK                     0x00000004
#define _RPOR17_RP178R2_LENGTH                   0x00000001

#define _RPOR17_RP178R3_POSITION                 0x00000003
#define _RPOR17_RP178R3_MASK                     0x00000008
#define _RPOR17_RP178R3_LENGTH                   0x00000001

#define _RPOR17_RP178R4_POSITION                 0x00000004
#define _RPOR17_RP178R4_MASK                     0x00000010
#define _RPOR17_RP178R4_LENGTH                   0x00000001

#define _RPOR17_RP178R5_POSITION                 0x00000005
#define _RPOR17_RP178R5_MASK                     0x00000020
#define _RPOR17_RP178R5_LENGTH                   0x00000001

#define _RPOR17_RP179R0_POSITION                 0x00000008
#define _RPOR17_RP179R0_MASK                     0x00000100
#define _RPOR17_RP179R0_LENGTH                   0x00000001

#define _RPOR17_RP179R1_POSITION                 0x00000009
#define _RPOR17_RP179R1_MASK                     0x00000200
#define _RPOR17_RP179R1_LENGTH                   0x00000001

#define _RPOR17_RP179R2_POSITION                 0x0000000A
#define _RPOR17_RP179R2_MASK                     0x00000400
#define _RPOR17_RP179R2_LENGTH                   0x00000001

#define _RPOR17_RP179R3_POSITION                 0x0000000B
#define _RPOR17_RP179R3_MASK                     0x00000800
#define _RPOR17_RP179R3_LENGTH                   0x00000001

#define _RPOR17_RP179R4_POSITION                 0x0000000C
#define _RPOR17_RP179R4_MASK                     0x00001000
#define _RPOR17_RP179R4_LENGTH                   0x00000001

#define _RPOR17_RP179R5_POSITION                 0x0000000D
#define _RPOR17_RP179R5_MASK                     0x00002000
#define _RPOR17_RP179R5_LENGTH                   0x00000001

#define _RPOR18_RP180R_POSITION                  0x00000000
#define _RPOR18_RP180R_MASK                      0x0000003F
#define _RPOR18_RP180R_LENGTH                    0x00000006

#define _RPOR18_RP181R_POSITION                  0x00000008
#define _RPOR18_RP181R_MASK                      0x00003F00
#define _RPOR18_RP181R_LENGTH                    0x00000006

#define _RPOR18_RP180R0_POSITION                 0x00000000
#define _RPOR18_RP180R0_MASK                     0x00000001
#define _RPOR18_RP180R0_LENGTH                   0x00000001

#define _RPOR18_RP180R1_POSITION                 0x00000001
#define _RPOR18_RP180R1_MASK                     0x00000002
#define _RPOR18_RP180R1_LENGTH                   0x00000001

#define _RPOR18_RP180R2_POSITION                 0x00000002
#define _RPOR18_RP180R2_MASK                     0x00000004
#define _RPOR18_RP180R2_LENGTH                   0x00000001

#define _RPOR18_RP180R3_POSITION                 0x00000003
#define _RPOR18_RP180R3_MASK                     0x00000008
#define _RPOR18_RP180R3_LENGTH                   0x00000001

#define _RPOR18_RP180R4_POSITION                 0x00000004
#define _RPOR18_RP180R4_MASK                     0x00000010
#define _RPOR18_RP180R4_LENGTH                   0x00000001

#define _RPOR18_RP180R5_POSITION                 0x00000005
#define _RPOR18_RP180R5_MASK                     0x00000020
#define _RPOR18_RP180R5_LENGTH                   0x00000001

#define _RPOR18_RP181R0_POSITION                 0x00000008
#define _RPOR18_RP181R0_MASK                     0x00000100
#define _RPOR18_RP181R0_LENGTH                   0x00000001

