MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS506/mcu.h
#define _IPC28_ADCAN4IP0_POSITION                0x00000008
#define _IPC28_ADCAN4IP0_MASK                    0x00000100
#define _IPC28_ADCAN4IP0_LENGTH                  0x00000001

#define _IPC28_ADCAN4IP1_POSITION                0x00000009
#define _IPC28_ADCAN4IP1_MASK                    0x00000200
#define _IPC28_ADCAN4IP1_LENGTH                  0x00000001

#define _IPC28_ADCAN4IP2_POSITION                0x0000000A
#define _IPC28_ADCAN4IP2_MASK                    0x00000400
#define _IPC28_ADCAN4IP2_LENGTH                  0x00000001

#define _IPC28_ADCAN5IP0_POSITION                0x0000000C
#define _IPC28_ADCAN5IP0_MASK                    0x00001000
#define _IPC28_ADCAN5IP0_LENGTH                  0x00000001

#define _IPC28_ADCAN5IP1_POSITION                0x0000000D
#define _IPC28_ADCAN5IP1_MASK                    0x00002000
#define _IPC28_ADCAN5IP1_LENGTH                  0x00000001

#define _IPC28_ADCAN5IP2_POSITION                0x0000000E
#define _IPC28_ADCAN5IP2_MASK                    0x00004000
#define _IPC28_ADCAN5IP2_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP_POSITION                 0x00000000
#define _IPC29_ADCAN6IP_MASK                     0x00000007
#define _IPC29_ADCAN6IP_LENGTH                   0x00000003

#define _IPC29_ADCAN7IP_POSITION                 0x00000004
#define _IPC29_ADCAN7IP_MASK                     0x00000070
#define _IPC29_ADCAN7IP_LENGTH                   0x00000003

#define _IPC29_ADCAN6IP0_POSITION                0x00000000
#define _IPC29_ADCAN6IP0_MASK                    0x00000001
#define _IPC29_ADCAN6IP0_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP1_POSITION                0x00000001
#define _IPC29_ADCAN6IP1_MASK                    0x00000002
#define _IPC29_ADCAN6IP1_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP2_POSITION                0x00000002
#define _IPC29_ADCAN6IP2_MASK                    0x00000004
#define _IPC29_ADCAN6IP2_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP0_POSITION                0x00000004
#define _IPC29_ADCAN7IP0_MASK                    0x00000010
#define _IPC29_ADCAN7IP0_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP1_POSITION                0x00000005
#define _IPC29_ADCAN7IP1_MASK                    0x00000020
#define _IPC29_ADCAN7IP1_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP2_POSITION                0x00000006
#define _IPC29_ADCAN7IP2_MASK                    0x00000040
#define _IPC29_ADCAN7IP2_LENGTH                  0x00000001

#define _IPC35_ICDIP_POSITION                    0x00000008
#define _IPC35_ICDIP_MASK                        0x00000700
#define _IPC35_ICDIP_LENGTH                      0x00000003

#define _IPC35_JTAGIP_POSITION                   0x0000000C
#define _IPC35_JTAGIP_MASK                       0x00007000
#define _IPC35_JTAGIP_LENGTH                     0x00000003

#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _IPC35_JTAGIP0_POSITION                  0x0000000C
#define _IPC35_JTAGIP0_MASK                      0x00001000
#define _IPC35_JTAGIP0_LENGTH                    0x00000001

#define _IPC35_JTAGIP1_POSITION                  0x0000000D
#define _IPC35_JTAGIP1_MASK                      0x00002000
#define _IPC35_JTAGIP1_LENGTH                    0x00000001

#define _IPC35_JTAGIP2_POSITION                  0x0000000E
#define _IPC35_JTAGIP2_MASK                      0x00004000
#define _IPC35_JTAGIP2_LENGTH                    0x00000001

#define _IPC37_ADCAN8IP_POSITION                 0x0000000C
#define _IPC37_ADCAN8IP_MASK                     0x00007000
#define _IPC37_ADCAN8IP_LENGTH                   0x00000003

#define _IPC37_ADCAN8IP0_POSITION                0x0000000C
#define _IPC37_ADCAN8IP0_MASK                    0x00001000
#define _IPC37_ADCAN8IP0_LENGTH                  0x00000001

#define _IPC37_ADCAN8IP1_POSITION                0x0000000D
#define _IPC37_ADCAN8IP1_MASK                    0x00002000
#define _IPC37_ADCAN8IP1_LENGTH                  0x00000001

#define _IPC37_ADCAN8IP2_POSITION                0x0000000E
#define _IPC37_ADCAN8IP2_MASK                    0x00004000
#define _IPC37_ADCAN8IP2_LENGTH                  0x00000001

#define _IPC38_ADCAN9IP_POSITION                 0x00000000
#define _IPC38_ADCAN9IP_MASK                     0x00000007
#define _IPC38_ADCAN9IP_LENGTH                   0x00000003

#define _IPC38_ADCAN10IP_POSITION                0x00000004
#define _IPC38_ADCAN10IP_MASK                    0x00000070
#define _IPC38_ADCAN10IP_LENGTH                  0x00000003

#define _IPC38_ADCAN11IP_POSITION                0x00000008
#define _IPC38_ADCAN11IP_MASK                    0x00000700
#define _IPC38_ADCAN11IP_LENGTH                  0x00000003

#define _IPC38_ADCAN12IP_POSITION                0x0000000C
#define _IPC38_ADCAN12IP_MASK                    0x00007000
#define _IPC38_ADCAN12IP_LENGTH                  0x00000003

#define _IPC38_ADCAN9IP0_POSITION                0x00000000
#define _IPC38_ADCAN9IP0_MASK                    0x00000001
#define _IPC38_ADCAN9IP0_LENGTH                  0x00000001

#define _IPC38_ADCAN9IP1_POSITION                0x00000001
#define _IPC38_ADCAN9IP1_MASK                    0x00000002
#define _IPC38_ADCAN9IP1_LENGTH                  0x00000001

#define _IPC38_ADCAN9IP2_POSITION                0x00000002
#define _IPC38_ADCAN9IP2_MASK                    0x00000004
#define _IPC38_ADCAN9IP2_LENGTH                  0x00000001

#define _IPC38_ADCAN10IP0_POSITION               0x00000004
#define _IPC38_ADCAN10IP0_MASK                   0x00000010
#define _IPC38_ADCAN10IP0_LENGTH                 0x00000001

#define _IPC38_ADCAN10IP1_POSITION               0x00000005
#define _IPC38_ADCAN10IP1_MASK                   0x00000020
#define _IPC38_ADCAN10IP1_LENGTH                 0x00000001

#define _IPC38_ADCAN10IP2_POSITION               0x00000006
#define _IPC38_ADCAN10IP2_MASK                   0x00000040
#define _IPC38_ADCAN10IP2_LENGTH                 0x00000001

#define _IPC38_ADCAN11IP0_POSITION               0x00000008
#define _IPC38_ADCAN11IP0_MASK                   0x00000100
#define _IPC38_ADCAN11IP0_LENGTH                 0x00000001

#define _IPC38_ADCAN11IP1_POSITION               0x00000009
#define _IPC38_ADCAN11IP1_MASK                   0x00000200
#define _IPC38_ADCAN11IP1_LENGTH                 0x00000001

