MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS506/mcu.h
#define ALTI2C1_ON           0x0051
#define ALTI2C1_OFF          0x0059

#define ALTI2C2_ON           0x0049
#define ALTI2C2_OFF          0x0059

#define DBCC_ON              0x0019
#define DBCC_OFF             0x0059

/* Register FALTREG (0xafb0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0xafb0),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 1 bits:
**     CTXT1_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT1_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT1_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT1_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT1_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT1_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT1_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT1_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT2_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT2_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT2_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT2_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT2_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT2_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT2_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT2_OFF            Not Assigned
**
*/

#define CTXT1_IPL1           0x0070
#define CTXT1_IPL2           0x0071
#define CTXT1_IPL3           0x0072
#define CTXT1_IPL4           0x0073
#define CTXT1_IPL5           0x0074
#define CTXT1_IPL6           0x0075
#define CTXT1_IPL7           0x0076
#define CTXT1_OFF            0x0077

#define CTXT2_IPL1           0x0007
#define CTXT2_IPL2           0x0017
#define CTXT2_IPL3           0x0027
#define CTXT2_IPL4           0x0037
#define CTXT2_IPL5           0x0047
#define CTXT2_IPL6           0x0057
#define CTXT2_IPL7           0x0067
#define CTXT2_OFF            0x0077

/* Register FBTSEQ (0xaffc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0xaffc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif

/* Fuses that are only present in dual panel mode */

#ifdef __DUAL_PARTITION
/* Register FSEC (0x5780)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0x5780),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HIGH             High Security
**     BSS_STNDRD           Standard Security
**     BSS_DISABLED         No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HIGH             High Security
**     GSS_STNDRD           Standard Security
**     GSS_DISABLED         No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HIGH             High Security
**     CSS_ENHNCD           Enhanced Security
**     CSS_STNDRD           Standard Security
**     CSS_DISABLED         No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table bit:
**     AIVTDIS_ON           Enabled AIVT
**     AIVTDIS_OFF          Disabled AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

#define BSS_HIGH             0x8FE9
#define BSS_STNDRD           0x8FED
#define BSS_DISABLED         0x8FEF

